SELECT 
s.ГРУППА,
s.ИД,
l.ИМЯ,
l.ФАМИЛИЯ,
l.ОТЧЕСТВО,
s.П_ПРКОК_ИД
FROM Н_УЧЕНИКИ AS s JOIN Н_ЛЮДИ AS l ON l.ИД=s.ЧЛВК_ИД
JOIN Н_ПЛАНЫ ON Н_ПЛАНЫ.ИД = s.ПЛАН_ИД
JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД= Н_ФОРМЫ_ОБУЧЕНИЯ.ИД 
JOIN Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД = Н_ПЛАНЫ.НАПС_ИД
JOIN Н_НАПР_СПЕЦ ON Н_НАПР_СПЕЦ.ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД
WHERE (Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ  = 'Очная' AND Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101')
AND s.ИД IN 
(SELECT s.ИД
FROM Н_УЧЕНИКИ
WHERE s.ПРИЗНАК= 'отчисл'
AND s.СОСТОЯНИЕ ='утвержден'
AND s.КОНЕЦ < '2012-09-01')

