
--1
SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ 
RIGHT JOIN Н_ВЕДОМОСТИ
ON Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ТВ_ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = 3 
AND Н_ВЕДОМОСТИ.ДАТА < '2010-06-18'
AND Н_ВЕДОМОСТИ.ДАТА > '2010-06-18'

--2
SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.ИД
FROM Н_ЛЮДИ 
INNER JOIN Н_ОБУЧЕНИЯ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД=Н_ЛЮДИ.ИД
INNER JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД=Н_ЛЮДИ.ИД
WHERE Н_ЛЮДИ.ИД = 100012 
AND Н_ОБУЧЕНИЯ.НЗК > '933232'

--3
SELECT COUNT(*)
FROM (
 SELECT Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ
 FROM Н_ЛЮДИ
 GROUP BY Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ
) AS ДатаРождения; 

--7
SELECT отчества COUNT(*)
FROM Н_ЛЮДИ
GROUP BY отчества
HAVING COUNT(*) = 10





--
SELECT
COUNT(DISTINCT Н_УЧЕНИКИ.ЧЛВК_ИД) AS число_отличников
FROM
Н_УЧЕНИКИ
 JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
 JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
 JOIN Н_ОТДЕЛЫ ON Н_ОТДЕЛЫ.ИД = Н_ПЛАНЫ.ОТД_ИД
 AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'СПбГУИТМО'
WHERE
NOT EXISTS (
 SELECT
 *
 FROM
 Н_ВЕДОМОСТИ
 WHERE
 Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
 AND Н_ВЕДОМОСТИ.ОЦЕНКА NOT IN ('зачет', 'осв', '5') 